[Survived] StringLiteral
arkham-odds/src/tokens/Token.ts:6:14
  */
 export enum Token {
   ELDER_SIGN = "Elder sign",
-  PLUS_ONE = "+1",
+  PLUS_ONE = "",
   ZERO = "0",
   MINUS_ONE = "-1",

[Survived] StringLiteral
arkham-odds/src/tokens/Token.ts:14:17
   MINUS_FOUR = "-4",
   MINUS_FIVE = "-5",
   MINUS_SIX = "-6",
-  MINUS_SEVEN = "-7",
+  MINUS_SEVEN = "",
   MINUS_EIGHT = "-8",
   SKULL = "Skull",
