[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/Fraction.ts:2:7
 function gcd(a: number, b: number): number {
-  if (a === 0 || b === 0) {
+  if (true) {
     return 0;
   }

[Killed] EqualityOperator
arkham-odds/arkham-odds/src/Fraction.ts:2:9
 function gcd(a: number, b: number): number {
-  if (a === 0 || b === 0) {
+  if (a !== 0 || b === 0) {
     return 0;
   }

[Killed] BlockStatement
arkham-odds/arkham-odds/src/Fraction.ts:5:16
   if (a === 0 || b === 0) {
     return 0;
   }
-  if (a === b) {
-    return a;
-  }
+  if (a === b) {}
   if (a > b) {
     return gcd(a - b, b);

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/Fraction.ts:5:7
   if (a === 0 || b === 0) {
     return 0;
   }
-  if (a === b) {
+  if (false) {
     return a;
   }

[Killed] EqualityOperator
arkham-odds/arkham-odds/src/Fraction.ts:8:9
   if (a === b) {
     return a;
   }
-  if (a > b) {
+  if (a <= b) {
     return gcd(a - b, b);
   }

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/Fraction.ts:8:7
   if (a === b) {
     return a;
   }
-  if (a > b) {
+  if (true) {
     return gcd(a - b, b);
   }

[Killed] ArithmeticOperator
arkham-odds/arkham-odds/src/Fraction.ts:9:18
     return a;
   }
   if (a > b) {
-    return gcd(a - b, b);
+    return gcd(a + b, b);
   }
   return gcd(a, b - a);

[Killed] ArithmeticOperator
arkham-odds/arkham-odds/src/Fraction.ts:11:19
   if (a > b) {
     return gcd(a - b, b);
   }
-  return gcd(a, b - a);
+  return gcd(a, b + a);
 }
 

[Killed] ArithmeticOperator
arkham-odds/arkham-odds/src/Fraction.ts:46:44
    */
   public add(other: Fraction): Fraction {
     return new Fraction(
-      this._numerator * other._denominator +
+      this._numerator * other._denominator -
         other._numerator * this._denominator,
       this._denominator * other._denominator

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/Fraction.ts:74:7
     this._reduce();
     other._reduce();
     return (
-      this._numerator === other._numerator &&
-      this._denominator === other._denominator
+      false
     );
   }
