[Killed] BlockStatement
arkham-odds/src/bag/Bag.ts:31:32
    *   The tokens to put in the bag. The bag will hold a copy of these tokens
    *   so that changes to the original array of tokens does not affect the bag.
    */
-  constructor(tokens: Token[]) {
-    this._tokens = tokens.slice(0);
-  }
+  constructor(tokens: Token[]) {}
 
   /**
