[Killed] BlockStatement
arkham-odds/src/tokens/TokenEffects.ts:15:48
 export class TokenEffects {
   private _map: Map<Token, TokenEffect>;
 
-  constructor(mappings?: TokenEffectMapping[]) {
-    if (mappings) {
-      this._map = new Map(mappings);
-    } else {
-      this._map = new Map<Token, TokenEffect>();
-    }
-  }
+  constructor(mappings?: TokenEffectMapping[]) {}
 
   /**

[Killed] BlockStatement
arkham-odds/src/tokens/TokenEffects.ts:18:12
   constructor(mappings?: TokenEffectMapping[]) {
     if (mappings) {
       this._map = new Map(mappings);
-    } else {
-      this._map = new Map<Token, TokenEffect>();
-    }
+    } else {}
   }
 

[Killed] BlockStatement
arkham-odds/src/tokens/TokenEffects.ts:66:43
    */
   public setEffects(mappings: TokenEffectMapping[]): TokenEffects {
     const newMap = new Map(this._map);
-    mappings.forEach(([token, effect]) => {
-      newMap.set(token, effect);
-    });
+    mappings.forEach(([token, effect]) => {});
 
     const newEffects = new TokenEffects();

[Killed] ConditionalExpression
arkham-odds/src/tokens/TokenEffects.ts:105:12
    * @return {boolean} `true` if the token is autosuccess, `false` otherwise.
    */
   public isTokenAutoSuccess(token: Token): boolean {
-    return this._map.get(token).getOutcome() === TokenEffectType.AUTOSUCCESS;
+    return false;
   }
 

[Killed] ConditionalExpression
arkham-odds/src/tokens/TokenEffects.ts:117:12
    * @return {boolean} `true` if the token is autofail, `false` otherwise.
    */
   public isTokenAutoFail(token: Token): boolean {
-    return this._map.get(token).getOutcome() === TokenEffectType.AUTOFAIL;
+    return true;
   }
 

[Killed] EqualityOperator
arkham-odds/src/tokens/TokenEffects.ts:130:43
    * @throws {TypeError} if the specified token is an autosuccess or an autofail.
    */
   public getTokenModifier(token: Token): number {
-    if (this._map.get(token).getOutcome() !== TokenEffectType.MODIFIER) {
+    if (this._map.get(token).getOutcome() === TokenEffectType.MODIFIER) {
       throw new TypeError(`token ${token} is not a modifier`);
     }

[Survived] ConditionalExpression
arkham-odds/src/tokens/TokenEffects.ts:146:11
    */
   public sortByBestOutcomeDesc(tokens: Token[]): Token[] {
     return tokens.sort((tokenA: Token, tokenB: Token) => {
-      if (tokenA === tokenB) {
+      if (false) {
         return 0;
       }

[Killed] LogicalOperator
arkham-odds/src/tokens/TokenEffects.ts:149:43
       if (tokenA === tokenB) {
         return 0;
       }
-      if (this.isTokenAutoSuccess(tokenA) && !this.isTokenAutoSuccess(tokenB)) {
+      if (this.isTokenAutoSuccess(tokenA) || !this.isTokenAutoSuccess(tokenB)) {
         return -1;
       }

[Survived] ConditionalExpression
arkham-odds/src/tokens/TokenEffects.ts:152:11
       if (this.isTokenAutoSuccess(tokenA) && !this.isTokenAutoSuccess(tokenB)) {
         return -1;
       }
-      if (this.isTokenAutoSuccess(tokenB) && !this.isTokenAutoSuccess(tokenA)) {
+      if (false) {
         return 1;
       }

[Killed] BlockStatement
arkham-odds/src/tokens/TokenEffects.ts:155:74
       if (this.isTokenAutoSuccess(tokenB) && !this.isTokenAutoSuccess(tokenA)) {
         return 1;
       }
-      if (this.isTokenAutoFail(tokenA) && !this.isTokenAutoFail(tokenB)) {
-        return 1;
-      }
+      if (this.isTokenAutoFail(tokenA) && !this.isTokenAutoFail(tokenB)) {}
       if (this.isTokenAutoFail(tokenB) && !this.isTokenAutoFail(tokenA)) {
         return -1;

[Killed] ConditionalExpression
arkham-odds/src/tokens/TokenEffects.ts:155:11
       if (this.isTokenAutoSuccess(tokenB) && !this.isTokenAutoSuccess(tokenA)) {
         return 1;
       }
-      if (this.isTokenAutoFail(tokenA) && !this.isTokenAutoFail(tokenB)) {
+      if (true) {
         return 1;
       }

[Killed] BooleanLiteral
arkham-odds/src/tokens/TokenEffects.ts:158:43
       if (this.isTokenAutoFail(tokenA) && !this.isTokenAutoFail(tokenB)) {
         return 1;
       }
-      if (this.isTokenAutoFail(tokenB) && !this.isTokenAutoFail(tokenA)) {
+      if (this.isTokenAutoFail(tokenB) && this.isTokenAutoFail(tokenA)) {
         return -1;
       }

[Killed] ConditionalExpression
arkham-odds/src/tokens/TokenEffects.ts:180:9
    */
   public isSuccess(tokens: Token[], skillMinusDifficulty: number): boolean {
     // Autofail prevails
-    if (tokens.some(t => this.isTokenAutoFail(t))) {
+    if (true) {
       return false;
     }

[Killed] BooleanLiteral
arkham-odds/src/tokens/TokenEffects.ts:181:14
   public isSuccess(tokens: Token[], skillMinusDifficulty: number): boolean {
     // Autofail prevails
     if (tokens.some(t => this.isTokenAutoFail(t))) {
-      return false;
+      return true;
     }
     if (tokens.some(t => this.isTokenAutoSuccess(t))) {

[Killed] BlockStatement
arkham-odds/src/tokens/TokenEffects.ts:183:55
     if (tokens.some(t => this.isTokenAutoFail(t))) {
       return false;
     }
-    if (tokens.some(t => this.isTokenAutoSuccess(t))) {
-      return true;
-    }
+    if (tokens.some(t => this.isTokenAutoSuccess(t))) {}
     return (
       tokens.reduce((sum, t) => sum + this.getTokenModifier(t), 0) +

[Killed] EqualityOperator
arkham-odds/src/tokens/TokenEffects.ts:188:30
     }
     return (
       tokens.reduce((sum, t) => sum + this.getTokenModifier(t), 0) +
-        skillMinusDifficulty >=
+        skillMinusDifficulty >
       0
     );

[Killed] ArrowFunction
arkham-odds/src/tokens/TokenEffects.ts:207:38
     tokens: Token[]
   ): { redrawTokens: Token[]; nonRedrawTokens: Token[] } {
     return {
-      nonRedrawTokens: tokens.filter(t => !this.getEffect(t).isRedraw()),
+      nonRedrawTokens: tokens.filter(() => undefined),
       redrawTokens: tokens.filter(t => this.getEffect(t).isRedraw())
     };

[Survived] ArrayDeclaration
arkham-odds/src/tokens/TokenEffects.ts:213:67
   }
 }
 
-export const DefaultTokenEffects: TokenEffects = new TokenEffects([
-  [Token.PLUS_ONE, new Modifier(1)],
-  [Token.PLUS_ONE, new Modifier(1)],
-  [Token.ZERO, new Modifier(0)],
-  [Token.MINUS_ONE, new Modifier(-1)],
-  [Token.MINUS_TWO, new Modifier(-2)],
-  [Token.MINUS_THREE, new Modifier(-3)],
-  [Token.MINUS_FOUR, new Modifier(-4)],
-  [Token.MINUS_FIVE, new Modifier(-5)],
-  [Token.MINUS_SIX, new Modifier(-6)],
-  [Token.MINUS_SEVEN, new Modifier(-7)],
-  [Token.MINUS_EIGHT, new Modifier(-8)],
-  [Token.AUTOFAIL, new Autofail()],
-  [Token.BLESS, new Modifier(2, true)],
-  [Token.CURSE, new Modifier(-2, true)]
-]);
+export const DefaultTokenEffects: TokenEffects = new TokenEffects([]);
 

[Survived] UnaryOperator
arkham-odds/src/tokens/TokenEffects.ts:217:34
   [Token.PLUS_ONE, new Modifier(1)],
   [Token.PLUS_ONE, new Modifier(1)],
   [Token.ZERO, new Modifier(0)],
-  [Token.MINUS_ONE, new Modifier(-1)],
+  [Token.MINUS_ONE, new Modifier(+1)],
   [Token.MINUS_TWO, new Modifier(-2)],
   [Token.MINUS_THREE, new Modifier(-3)],

[Survived] UnaryOperator
arkham-odds/src/tokens/TokenEffects.ts:218:34
   [Token.PLUS_ONE, new Modifier(1)],
   [Token.ZERO, new Modifier(0)],
   [Token.MINUS_ONE, new Modifier(-1)],
-  [Token.MINUS_TWO, new Modifier(-2)],
+  [Token.MINUS_TWO, new Modifier(+2)],
   [Token.MINUS_THREE, new Modifier(-3)],
   [Token.MINUS_FOUR, new Modifier(-4)],

[Survived] UnaryOperator
arkham-odds/src/tokens/TokenEffects.ts:219:36
   [Token.ZERO, new Modifier(0)],
   [Token.MINUS_ONE, new Modifier(-1)],
   [Token.MINUS_TWO, new Modifier(-2)],
-  [Token.MINUS_THREE, new Modifier(-3)],
+  [Token.MINUS_THREE, new Modifier(+3)],
   [Token.MINUS_FOUR, new Modifier(-4)],
   [Token.MINUS_FIVE, new Modifier(-5)],

[Survived] UnaryOperator
arkham-odds/src/tokens/TokenEffects.ts:220:35
   [Token.MINUS_ONE, new Modifier(-1)],
   [Token.MINUS_TWO, new Modifier(-2)],
   [Token.MINUS_THREE, new Modifier(-3)],
-  [Token.MINUS_FOUR, new Modifier(-4)],
+  [Token.MINUS_FOUR, new Modifier(+4)],
   [Token.MINUS_FIVE, new Modifier(-5)],
   [Token.MINUS_SIX, new Modifier(-6)],

[Survived] UnaryOperator
arkham-odds/src/tokens/TokenEffects.ts:221:35
   [Token.MINUS_TWO, new Modifier(-2)],
   [Token.MINUS_THREE, new Modifier(-3)],
   [Token.MINUS_FOUR, new Modifier(-4)],
-  [Token.MINUS_FIVE, new Modifier(-5)],
+  [Token.MINUS_FIVE, new Modifier(+5)],
   [Token.MINUS_SIX, new Modifier(-6)],
   [Token.MINUS_SEVEN, new Modifier(-7)],

[Survived] UnaryOperator
arkham-odds/src/tokens/TokenEffects.ts:222:34
   [Token.MINUS_THREE, new Modifier(-3)],
   [Token.MINUS_FOUR, new Modifier(-4)],
   [Token.MINUS_FIVE, new Modifier(-5)],
-  [Token.MINUS_SIX, new Modifier(-6)],
+  [Token.MINUS_SIX, new Modifier(+6)],
   [Token.MINUS_SEVEN, new Modifier(-7)],
   [Token.MINUS_EIGHT, new Modifier(-8)],

[Survived] UnaryOperator
arkham-odds/src/tokens/TokenEffects.ts:223:36
   [Token.MINUS_FOUR, new Modifier(-4)],
   [Token.MINUS_FIVE, new Modifier(-5)],
   [Token.MINUS_SIX, new Modifier(-6)],
-  [Token.MINUS_SEVEN, new Modifier(-7)],
+  [Token.MINUS_SEVEN, new Modifier(+7)],
   [Token.MINUS_EIGHT, new Modifier(-8)],
   [Token.AUTOFAIL, new Autofail()],

[Survived] UnaryOperator
arkham-odds/src/tokens/TokenEffects.ts:224:36
   [Token.MINUS_FIVE, new Modifier(-5)],
   [Token.MINUS_SIX, new Modifier(-6)],
   [Token.MINUS_SEVEN, new Modifier(-7)],
-  [Token.MINUS_EIGHT, new Modifier(-8)],
+  [Token.MINUS_EIGHT, new Modifier(+8)],
   [Token.AUTOFAIL, new Autofail()],
   [Token.BLESS, new Modifier(2, true)],

[Survived] BooleanLiteral
arkham-odds/src/tokens/TokenEffects.ts:226:33
   [Token.MINUS_SEVEN, new Modifier(-7)],
   [Token.MINUS_EIGHT, new Modifier(-8)],
   [Token.AUTOFAIL, new Autofail()],
-  [Token.BLESS, new Modifier(2, true)],
+  [Token.BLESS, new Modifier(2, false)],
   [Token.CURSE, new Modifier(-2, true)]
 ]);

[Survived] BooleanLiteral
arkham-odds/src/tokens/TokenEffects.ts:227:34
   [Token.MINUS_EIGHT, new Modifier(-8)],
   [Token.AUTOFAIL, new Autofail()],
   [Token.BLESS, new Modifier(2, true)],
-  [Token.CURSE, new Modifier(-2, true)]
+  [Token.CURSE, new Modifier(-2, false)]
 ]);
 

[Survived] UnaryOperator
arkham-odds/src/tokens/TokenEffects.ts:227:30
   [Token.MINUS_EIGHT, new Modifier(-8)],
   [Token.AUTOFAIL, new Autofail()],
   [Token.BLESS, new Modifier(2, true)],
-  [Token.CURSE, new Modifier(-2, true)]
+  [Token.CURSE, new Modifier(+2, true)]
 ]);
 
