[Survived] ConditionalExpression
arkham-odds/src/bag/Bags.ts:14:7
 function toTokens(tokenList: string): Token[] {
   return tokenList.split(",").map(s => {
     switch (s.trim()) {
-      case "Elder sign":
-        return Token.ELDER_SIGN;
+      case "Elder sign":
       case "+1":
         return Token.PLUS_ONE;

[Survived] StringLiteral
arkham-odds/src/bag/Bags.ts:14:12
 function toTokens(tokenList: string): Token[] {
   return tokenList.split(",").map(s => {
     switch (s.trim()) {
-      case "Elder sign":
+      case "":
         return Token.ELDER_SIGN;
       case "+1":

[Survived] ConditionalExpression
arkham-odds/src/bag/Bags.ts:16:7
     switch (s.trim()) {
       case "Elder sign":
         return Token.ELDER_SIGN;
-      case "+1":
-        return Token.PLUS_ONE;
+      case "+1":
       case "0":
         return Token.ZERO;

[Survived] StringLiteral
arkham-odds/src/bag/Bags.ts:16:12
     switch (s.trim()) {
       case "Elder sign":
         return Token.ELDER_SIGN;
-      case "+1":
+      case "":
         return Token.PLUS_ONE;
       case "0":

[Survived] ConditionalExpression
arkham-odds/src/bag/Bags.ts:18:7
         return Token.ELDER_SIGN;
       case "+1":
         return Token.PLUS_ONE;
-      case "0":
-        return Token.ZERO;
+      case "0":
       case "-1":
         return Token.MINUS_ONE;

[Survived] ConditionalExpression
arkham-odds/src/bag/Bags.ts:20:7
         return Token.PLUS_ONE;
       case "0":
         return Token.ZERO;
-      case "-1":
-        return Token.MINUS_ONE;
+      case "-1":
       case "-2":
         return Token.MINUS_TWO;

[Survived] ConditionalExpression
arkham-odds/src/bag/Bags.ts:22:7
         return Token.ZERO;
       case "-1":
         return Token.MINUS_ONE;
-      case "-2":
-        return Token.MINUS_TWO;
+      case "-2":
       case "-3":
         return Token.MINUS_THREE;

[Survived] ConditionalExpression
arkham-odds/src/bag/Bags.ts:24:7
         return Token.MINUS_ONE;
       case "-2":
         return Token.MINUS_TWO;
-      case "-3":
-        return Token.MINUS_THREE;
+      case "-3":
       case "-4":
         return Token.MINUS_FOUR;

[Survived] ConditionalExpression
arkham-odds/src/bag/Bags.ts:26:7
         return Token.MINUS_TWO;
       case "-3":
         return Token.MINUS_THREE;
-      case "-4":
-        return Token.MINUS_FOUR;
+      case "-4":
       case "-5":
         return Token.MINUS_FIVE;

[Survived] ConditionalExpression
arkham-odds/src/bag/Bags.ts:28:7
         return Token.MINUS_THREE;
       case "-4":
         return Token.MINUS_FOUR;
-      case "-5":
-        return Token.MINUS_FIVE;
+      case "-5":
       case "-6":
         return Token.MINUS_SIX;

[Survived] StringLiteral
arkham-odds/src/bag/Bags.ts:28:12
         return Token.MINUS_THREE;
       case "-4":
         return Token.MINUS_FOUR;
-      case "-5":
+      case "":
         return Token.MINUS_FIVE;
       case "-6":

[Survived] ConditionalExpression
arkham-odds/src/bag/Bags.ts:30:7
         return Token.MINUS_FOUR;
       case "-5":
         return Token.MINUS_FIVE;
-      case "-6":
-        return Token.MINUS_SIX;
+      case "-6":
       case "-7":
         return Token.MINUS_SEVEN;

[Survived] ConditionalExpression
arkham-odds/src/bag/Bags.ts:32:7
         return Token.MINUS_FIVE;
       case "-6":
         return Token.MINUS_SIX;
-      case "-7":
-        return Token.MINUS_SEVEN;
+      case "-7":
       case "-8":
         return Token.MINUS_EIGHT;

[Survived] StringLiteral
arkham-odds/src/bag/Bags.ts:32:12
         return Token.MINUS_FIVE;
       case "-6":
         return Token.MINUS_SIX;
-      case "-7":
+      case "":
         return Token.MINUS_SEVEN;
       case "-8":

[Survived] ConditionalExpression
arkham-odds/src/bag/Bags.ts:34:7
         return Token.MINUS_SIX;
       case "-7":
         return Token.MINUS_SEVEN;
-      case "-8":
-        return Token.MINUS_EIGHT;
+      case "-8":
       case "Skull":
         return Token.SKULL;

[Survived] StringLiteral
arkham-odds/src/bag/Bags.ts:34:12
         return Token.MINUS_SIX;
       case "-7":
         return Token.MINUS_SEVEN;
-      case "-8":
+      case "":
         return Token.MINUS_EIGHT;
       case "Skull":

[Survived] ConditionalExpression
arkham-odds/src/bag/Bags.ts:36:7
         return Token.MINUS_SEVEN;
       case "-8":
         return Token.MINUS_EIGHT;
-      case "Skull":
-        return Token.SKULL;
+      case "Skull":
       case "Cultist":
         return Token.CULTIST;

[Survived] ConditionalExpression
arkham-odds/src/bag/Bags.ts:38:7
         return Token.MINUS_EIGHT;
       case "Skull":
         return Token.SKULL;
-      case "Cultist":
-        return Token.CULTIST;
+      case "Cultist":
       case "Tablet":
         return Token.TABLET;

[Survived] StringLiteral
arkham-odds/src/bag/Bags.ts:38:12
         return Token.MINUS_EIGHT;
       case "Skull":
         return Token.SKULL;
-      case "Cultist":
+      case "":
         return Token.CULTIST;
       case "Tablet":

[Survived] ConditionalExpression
arkham-odds/src/bag/Bags.ts:40:7
         return Token.SKULL;
       case "Cultist":
         return Token.CULTIST;
-      case "Tablet":
-        return Token.TABLET;
+      case "Tablet":
       case "Elder thing":
         return Token.ELDER_THING;

[Survived] StringLiteral
arkham-odds/src/bag/Bags.ts:40:12
         return Token.SKULL;
       case "Cultist":
         return Token.CULTIST;
-      case "Tablet":
+      case "":
         return Token.TABLET;
       case "Elder thing":

[Survived] ConditionalExpression
arkham-odds/src/bag/Bags.ts:42:7
         return Token.CULTIST;
       case "Tablet":
         return Token.TABLET;
-      case "Elder thing":
-        return Token.ELDER_THING;
+      case "Elder thing":
       case "Autofail":
         return Token.AUTOFAIL;

[Survived] ConditionalExpression
arkham-odds/src/bag/Bags.ts:44:7
         return Token.TABLET;
       case "Elder thing":
         return Token.ELDER_THING;
-      case "Autofail":
-        return Token.AUTOFAIL;
+      case "Autofail":
       default:
         return null;

[Survived] StringLiteral
arkham-odds/src/bag/Bags.ts:44:12
         return Token.TABLET;
       case "Elder thing":
         return Token.ELDER_THING;
-      case "Autofail":
+      case "":
         return Token.AUTOFAIL;
       default:

[Survived] ObjectLiteral
arkham-odds/src/bag/Bags.ts:60:21
   /**
    * Night of the Zealot
    */
-  NightOfTheZealot: {
-    Easy: toTokens(
-      "+1, +1, 0, 0, 0, -1, -1, -1, -2, -2, Skull, Skull, Cultist, Tablet, Autofail, Elder sign"
-    ),
-    Standard: toTokens(
-      "+1, 0, 0, -1, -1, -1, -2, -2, -3, -4, Skull, Skull, Cultist, Tablet, Autofail, Elder sign"
-    ),
-    Hard: toTokens(
-      "0, 0, 0, -1, -1, -2, -2, -3, -3, -4, -5, Skull, Skull, Cultist, Tablet, Autofail, Elder sign"
-    ),
-    Expert: toTokens(
-      "0, -1, -1, -2, -2, -3, -3, -4, -4, -5, -6, -8, Skull, Skull, Cultist, Tablet, Autofail, Elder sign"
-    )
-  },
+  NightOfTheZealot: {},
   /**
    * The Dunwich Legacy

[Survived] StringLiteral
arkham-odds/src/bag/Bags.ts:68:7
       "+1, 0, 0, -1, -1, -1, -2, -2, -3, -4, Skull, Skull, Cultist, Tablet, Autofail, Elder sign"
     ),
     Hard: toTokens(
-      "0, 0, 0, -1, -1, -2, -2, -3, -3, -4, -5, Skull, Skull, Cultist, Tablet, Autofail, Elder sign"
+      ""
     ),
     Expert: toTokens(

[Survived] StringLiteral
arkham-odds/src/bag/Bags.ts:79:7
    */
   TheDunwichLegacy: {
     Easy: toTokens(
-      "+1, +1, 0, 0, 0, -1, -1, -1, -2, -2, Skull, Skull, Cultist, Autofail, Elder sign"
+      ""
     ),
     Standard: toTokens(

[Survived] StringLiteral
arkham-odds/src/bag/Bags.ts:88:7
       "0, 0, 0, -1, -1, -2, -2, -3, -3, -4, -5, Skull, Skull, Cultist, Autofail, Elder sign"
     ),
     Expert: toTokens(
-      "0, -1, -1, -2, -2, -3, -3, -4, -4, -5, -6, -8, Skull, Skull, Cultist, Autofail, Elder sign"
+      ""
     )
   },

[Survived] ObjectLiteral
arkham-odds/src/bag/Bags.ts:94:21
   /**
    * The Path to Carcosa
    */
-  ThePathToCarcosa: {
-    Easy: toTokens(
-      "+1, +1, 0, 0, 0, -1, -1, -1, -2, -2, Skull, Skull, Skull, Autofail, Elder sign"
-    ),
-    Standard: toTokens(
-      "+1, 0, 0, -1, -1, -1, -2, -2, -3, -4, Skull, Skull, Skull, Autofail, Elder sign"
-    ),
-    Hard: toTokens(
-      "0, 0, 0, -1, -1, -2, -2, -3, -3, -4, -5, Skull, Skull, Skull, Autofail, Elder sign"
-    ),
-    Expert: toTokens(
-      "0, -1, -1, -2, -2, -3, -3, -4, -4, -5, -6, -8, Skull, Skull, Skull, Autofail, Elder sign"
-    )
-  },
+  ThePathToCarcosa: {},
   /**
    * The Forgotten Age

[Survived] StringLiteral
arkham-odds/src/bag/Bags.ts:96:7
    */
   ThePathToCarcosa: {
     Easy: toTokens(
-      "+1, +1, 0, 0, 0, -1, -1, -1, -2, -2, Skull, Skull, Skull, Autofail, Elder sign"
+      ""
     ),
     Standard: toTokens(

[Survived] StringLiteral
arkham-odds/src/bag/Bags.ts:116:7
       "+1, +1, 0, 0, 0, -1, -1, -2, -3, Skull, Skull, Elder thing, Autofail, Elder sign"
     ),
     Standard: toTokens(
-      "+1, 0, 0, 0, -1, -2, -2, -3, -5, Skull, Skull, Elder thing, Autofail, Elder sign"
+      ""
     ),
     Hard: toTokens(

[Survived] ObjectLiteral
arkham-odds/src/bag/Bags.ts:162:33
   /**
    * The Dream-Eaters : The Web of Dreams
    */
-  TheDreamEatersTheWebOfDreams: {
-    Easy: toTokens(
-      "+1, +1, 0, 0, 0, –1, –1, –1, –2, –2, Skull, Skull, Cultist, Elder thing, Elder thing, Autofail, Elder sign"
-    ),
-    Standard: toTokens(
-      "+1, 0, 0, –1, –1, –1, –2, –2, –3, –4, Skull, Skull, Cultist, Elder thing, Elder thing, Autofail, Elder sign"
-    ),
-    Hard: toTokens(
-      "0, 0, 0, –1, –1, –2, –2, –3, –3, –4, –5, Skull, Skull, Cultist, Elder thing, Elder thing, Autofail, Elder sign"
-    ),
-    Expert: toTokens(
-      "0, –1, –1, –2, –2, –3, –3, –4, –4, –5, –6, –8, Skull, Skull, Cultist, Elder thing, Elder thing, Autofail, Elder sign"
-    )
-  },
+  TheDreamEatersTheWebOfDreams: {},
   /**
    * The Innsmouth Conspiracy

[Survived] StringLiteral
arkham-odds/src/bag/Bags.ts:164:7
    */
   TheDreamEatersTheWebOfDreams: {
     Easy: toTokens(
-      "+1, +1, 0, 0, 0, –1, –1, –1, –2, –2, Skull, Skull, Cultist, Elder thing, Elder thing, Autofail, Elder sign"
+      ""
     ),
     Standard: toTokens(

[Survived] StringLiteral
arkham-odds/src/bag/Bags.ts:190:7
       "0, 0, 0, –1, –1, –2, –2, –3, –3, –4, –5, Skull, Skull, Cultist, Cultist, Tablet, Tablet, Elder thing, Elder thing, Autofail, Elder sign"
     ),
     Expert: toTokens(
-      "0, –1, –1, –2, –2, –3, –3, –4, –4, –5, –6, –8, Skull, Skull, Cultist, Cultist, Tablet, Tablet, Elder thing, Elder thing, Autofail, Elder sign"
+      ""
     )
   },

[Survived] StringLiteral
arkham-odds/src/bag/Bags.ts:220:7
    */
   TheLabyrinthsOfLunacy: {
     Standard: toTokens(
-      "+1, 0, 0, 0, –1, –1, –1, –2, –2, –3, –4, –5, Skull, Skull, Autofail, Elder sign"
+      ""
     ),
     Hard: toTokens(

[Survived] ObjectLiteral
arkham-odds/src/bag/Bags.ts:251:29
   /**
    * The Blob That Ate Everything
    */
-  TheBlobThatAteEverything: {
-    Standard: toTokens(
-      "+1, 0, 0, 0, -1, -2, -2, -3, -4, -5, Skull, Skull, Cultist, Tablet, Elder thing, Autofail, Elder sign"
-    ),
-    Hard: toTokens(
-      "0, 0, 0, -1, -1, -2, -3, -4, -5, -6, Skull, Skull, Cultist, Tablet, Elder thing, Autofail, Elder sign"
-    )
-  }
+  TheBlobThatAteEverything: {}
 };
 

[Survived] StringLiteral
arkham-odds/src/bag/Bags.ts:253:7
    */
   TheBlobThatAteEverything: {
     Standard: toTokens(
-      "+1, 0, 0, 0, -1, -2, -2, -3, -4, -5, Skull, Skull, Cultist, Tablet, Elder thing, Autofail, Elder sign"
+      ""
     ),
     Hard: toTokens(

[Survived] StringLiteral
arkham-odds/src/bag/Bags.ts:256:7
       "+1, 0, 0, 0, -1, -2, -2, -3, -4, -5, Skull, Skull, Cultist, Tablet, Elder thing, Autofail, Elder sign"
     ),
     Hard: toTokens(
-      "0, 0, 0, -1, -1, -2, -3, -4, -5, -6, Skull, Skull, Cultist, Tablet, Elder thing, Autofail, Elder sign"
+      ""
     )
   }
