[Survived] ConditionalExpression
arkham-odds/src/tokens/TokenEffects.ts:16:9
   private _map: Map<Token, TokenEffect>;
 
   constructor(mappings?: TokenEffectMapping[]) {
-    if (mappings) {
+    if (true) {
       this._map = new Map(mappings);
     } else {

[Killed] ConditionalExpression
arkham-odds/src/tokens/TokenEffects.ts:105:12
    * @return {boolean} `true` if the token is autosuccess, `false` otherwise.
    */
   public isTokenAutoSuccess(token: Token): boolean {
-    return this._map.get(token).getOutcome() === TokenEffectType.AUTOSUCCESS;
+    return true;
   }
 

[Killed] EqualityOperator
arkham-odds/src/tokens/TokenEffects.ts:117:46
    * @return {boolean} `true` if the token is autofail, `false` otherwise.
    */
   public isTokenAutoFail(token: Token): boolean {
-    return this._map.get(token).getOutcome() === TokenEffectType.AUTOFAIL;
+    return this._map.get(token).getOutcome() !== TokenEffectType.AUTOFAIL;
   }
 

[Killed] ConditionalExpression
arkham-odds/src/tokens/TokenEffects.ts:149:11
       if (tokenA === tokenB) {
         return 0;
       }
-      if (this.isTokenAutoSuccess(tokenA) && !this.isTokenAutoSuccess(tokenB)) {
+      if (false) {
         return -1;
       }

[Killed] UnaryOperator
arkham-odds/src/tokens/TokenEffects.ts:150:16
         return 0;
       }
       if (this.isTokenAutoSuccess(tokenA) && !this.isTokenAutoSuccess(tokenB)) {
-        return -1;
+        return +1;
       }
       if (this.isTokenAutoSuccess(tokenB) && !this.isTokenAutoSuccess(tokenA)) {

[Survived] BooleanLiteral
arkham-odds/src/tokens/TokenEffects.ts:152:46
       if (this.isTokenAutoSuccess(tokenA) && !this.isTokenAutoSuccess(tokenB)) {
         return -1;
       }
-      if (this.isTokenAutoSuccess(tokenB) && !this.isTokenAutoSuccess(tokenA)) {
+      if (this.isTokenAutoSuccess(tokenB) && this.isTokenAutoSuccess(tokenA)) {
         return 1;
       }

[Killed] BooleanLiteral
arkham-odds/src/tokens/TokenEffects.ts:155:43
       if (this.isTokenAutoSuccess(tokenB) && !this.isTokenAutoSuccess(tokenA)) {
         return 1;
       }
-      if (this.isTokenAutoFail(tokenA) && !this.isTokenAutoFail(tokenB)) {
+      if (this.isTokenAutoFail(tokenA) && this.isTokenAutoFail(tokenB)) {
         return 1;
       }

[Killed] LogicalOperator
arkham-odds/src/tokens/TokenEffects.ts:158:40
       if (this.isTokenAutoFail(tokenA) && !this.isTokenAutoFail(tokenB)) {
         return 1;
       }
-      if (this.isTokenAutoFail(tokenB) && !this.isTokenAutoFail(tokenA)) {
+      if (this.isTokenAutoFail(tokenB) || !this.isTokenAutoFail(tokenA)) {
         return -1;
       }

[Killed] ArithmeticOperator
arkham-odds/src/tokens/TokenEffects.ts:161:44
       if (this.isTokenAutoFail(tokenB) && !this.isTokenAutoFail(tokenA)) {
         return -1;
       }
-      return this.getTokenModifier(tokenB) - this.getTokenModifier(tokenA);
+      return this.getTokenModifier(tokenB) + this.getTokenModifier(tokenA);
     });
   }

[Killed] ArrowFunction
arkham-odds/src/tokens/TokenEffects.ts:180:21
    */
   public isSuccess(tokens: Token[], skillMinusDifficulty: number): boolean {
     // Autofail prevails
-    if (tokens.some(t => this.isTokenAutoFail(t))) {
+    if (tokens.some(() => undefined)) {
       return false;
     }

[Killed] ConditionalExpression
arkham-odds/src/tokens/TokenEffects.ts:183:9
     if (tokens.some(t => this.isTokenAutoFail(t))) {
       return false;
     }
-    if (tokens.some(t => this.isTokenAutoSuccess(t))) {
+    if (false) {
       return true;
     }

[Killed] ConditionalExpression
arkham-odds/src/tokens/TokenEffects.ts:187:7
       return true;
     }
     return (
-      tokens.reduce((sum, t) => sum + this.getTokenModifier(t), 0) +
-        skillMinusDifficulty >=
-      0
+      false
     );
   }

[Killed] ArrowFunction
arkham-odds/src/tokens/TokenEffects.ts:187:21
       return true;
     }
     return (
-      tokens.reduce((sum, t) => sum + this.getTokenModifier(t), 0) +
+      tokens.reduce(() => undefined, 0) +
         skillMinusDifficulty >=
       0
