[Survived] ConditionalExpression
arkham-odds/arkham-odds/src/cards.ts:56:11
 export function ritualCandles(skillMinusDifficulty: number): OutcomeFunction {
   return (tokensPulled, tokenEffects) => {
     const candleBonus = tokensPulled.reduce((bonus, token) => {
-      if (BadTokens.includes(token)) {
+      if (true) {
         return bonus + 1;
       } else {

[Survived] ConditionalExpression
arkham-odds/arkham-odds/src/cards.ts:56:11
 export function ritualCandles(skillMinusDifficulty: number): OutcomeFunction {
   return (tokensPulled, tokenEffects) => {
     const candleBonus = tokensPulled.reduce((bonus, token) => {
-      if (BadTokens.includes(token)) {
+      if (false) {
         return bonus + 1;
       } else {

[Survived] ArithmeticOperator
arkham-odds/arkham-odds/src/cards.ts:57:22
   return (tokensPulled, tokenEffects) => {
     const candleBonus = tokensPulled.reduce((bonus, token) => {
       if (BadTokens.includes(token)) {
-        return bonus + 1;
+        return bonus - 1;
       } else {
         return bonus;

[Survived] ArithmeticOperator
arkham-odds/arkham-odds/src/cards.ts:64:28
     }, 0);
     return tokenEffects.isSuccess(
       tokensPulled,
-      skillMinusDifficulty + candleBonus
+      skillMinusDifficulty - candleBonus
     );
   };

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/cards.ts:104:9
   skillMinusDifficulty: number
 ): OutcomeFunction {
   return (tokensPulled, tokenEffects) => {
-    if (!tokensPulled.includes(Token.SKULL)) {
+    if (true) {
       return false;
     }

[Killed] BooleanLiteral
arkham-odds/arkham-odds/src/cards.ts:104:9
   skillMinusDifficulty: number
 ): OutcomeFunction {
   return (tokensPulled, tokenEffects) => {
-    if (!tokensPulled.includes(Token.SKULL)) {
+    if (tokensPulled.includes(Token.SKULL)) {
       return false;
     }

[Killed] BooleanLiteral
arkham-odds/arkham-odds/src/cards.ts:105:14
 ): OutcomeFunction {
   return (tokensPulled, tokenEffects) => {
     if (!tokensPulled.includes(Token.SKULL)) {
-      return false;
+      return true;
     }
 

[Killed] BlockStatement
arkham-odds/arkham-odds/src/cards.ts:149:62
   tokenEffects: TokenEffects
 ): Token | null {
   // Get tokens that can be turned to successes
-  const canBeTurnedToSuccesses = bag.getTokens().filter(t => {
-    return (
-      !tokenEffects.isSuccess([t], skillMinusDifficulty) &&
-      tokenEffects.isSuccess([t], skillMinusDifficulty + 2)
-    );
-  });
+  const canBeTurnedToSuccesses = bag.getTokens().filter(t => {});
 
   // Counting them

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/cards.ts:151:7
   // Get tokens that can be turned to successes
   const canBeTurnedToSuccesses = bag.getTokens().filter(t => {
     return (
-      !tokenEffects.isSuccess([t], skillMinusDifficulty) &&
-      tokenEffects.isSuccess([t], skillMinusDifficulty + 2)
+      false
     );
   });

[Killed] BooleanLiteral
arkham-odds/arkham-odds/src/cards.ts:151:7
   // Get tokens that can be turned to successes
   const canBeTurnedToSuccesses = bag.getTokens().filter(t => {
     return (
-      !tokenEffects.isSuccess([t], skillMinusDifficulty) &&
+      tokenEffects.isSuccess([t], skillMinusDifficulty) &&
       tokenEffects.isSuccess([t], skillMinusDifficulty + 2)
     );

[Killed] ArithmeticOperator
arkham-odds/arkham-odds/src/cards.ts:152:56
   const canBeTurnedToSuccesses = bag.getTokens().filter(t => {
     return (
       !tokenEffects.isSuccess([t], skillMinusDifficulty) &&
-      tokenEffects.isSuccess([t], skillMinusDifficulty + 2)
+      tokenEffects.isSuccess([t], skillMinusDifficulty - 2)
     );
   });

[Survived] ArrayDeclaration
arkham-odds/arkham-odds/src/cards.ts:152:30
   const canBeTurnedToSuccesses = bag.getTokens().filter(t => {
     return (
       !tokenEffects.isSuccess([t], skillMinusDifficulty) &&
-      tokenEffects.isSuccess([t], skillMinusDifficulty + 2)
+      tokenEffects.isSuccess([], skillMinusDifficulty + 2)
     );
   });

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/cards.ts:159:11
   // Counting them
   const countByToken = canBeTurnedToSuccesses.reduce(
     (acc: Map<Token, number>, t: Token) => {
-      if (acc.has(t)) {
+      if (false) {
         acc.set(t, acc.get(t) + 1);
       } else {

[Killed] BlockStatement
arkham-odds/arkham-odds/src/cards.ts:159:23
   // Counting them
   const countByToken = canBeTurnedToSuccesses.reduce(
     (acc: Map<Token, number>, t: Token) => {
-      if (acc.has(t)) {
-        acc.set(t, acc.get(t) + 1);
-      } else {
+      if (acc.has(t)) {} else {
         acc.set(t, 1);
       }

[Killed] ArithmeticOperator
arkham-odds/arkham-odds/src/cards.ts:160:31
   const countByToken = canBeTurnedToSuccesses.reduce(
     (acc: Map<Token, number>, t: Token) => {
       if (acc.has(t)) {
-        acc.set(t, acc.get(t) + 1);
+        acc.set(t, acc.get(t) - 1);
       } else {
         acc.set(t, 1);

[Killed] BlockStatement
arkham-odds/arkham-odds/src/cards.ts:161:14
     (acc: Map<Token, number>, t: Token) => {
       if (acc.has(t)) {
         acc.set(t, acc.get(t) + 1);
-      } else {
-        acc.set(t, 1);
-      }
+      } else {}
       return acc;
     },

[Killed] EqualityOperator
arkham-odds/arkham-odds/src/cards.ts:172:17
   // Choosing the one with the most occurrences
   const chosenToken: Token | null = Array.from(countByToken.entries()).reduce(
     ([previousToken, previousCount], [token, count]) => {
-      if (count > previousCount) {
+      if (count <= previousCount) {
         return [token, count];
       } else {

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/cards.ts:172:11
   // Choosing the one with the most occurrences
   const chosenToken: Token | null = Array.from(countByToken.entries()).reduce(
     ([previousToken, previousCount], [token, count]) => {
-      if (count > previousCount) {
+      if (false) {
         return [token, count];
       } else {

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/cards.ts:200:9
   let chosenToken: Token | null | undefined;
 
   return (tokensPulled, tokenEffects, bag) => {
-    if (chosenToken === undefined) {
+    if (false) {
       chosenToken = chooseTokenForRecallTheFuture(
         skillMinusDifficulty,

[Killed] BlockStatement
arkham-odds/arkham-odds/src/cards.ts:200:36
   let chosenToken: Token | null | undefined;
 
   return (tokensPulled, tokenEffects, bag) => {
-    if (chosenToken === undefined) {
-      chosenToken = chooseTokenForRecallTheFuture(
-        skillMinusDifficulty,
-        bag,
-        tokenEffects
-      );
-    }
+    if (chosenToken === undefined) {}
 
     if (chosenToken !== null && tokensPulled.includes(chosenToken)) {

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/cards.ts:208:9
       );
     }
 
-    if (chosenToken !== null && tokensPulled.includes(chosenToken)) {
+    if (false) {
       return tokenEffects.isSuccess(tokensPulled, skillMinusDifficulty + 2);
     } else {

[Killed] LogicalOperator
arkham-odds/arkham-odds/src/cards.ts:208:30
       );
     }
 
-    if (chosenToken !== null && tokensPulled.includes(chosenToken)) {
+    if (chosenToken !== null || tokensPulled.includes(chosenToken)) {
       return tokenEffects.isSuccess(tokensPulled, skillMinusDifficulty + 2);
     } else {

[Killed] ArithmeticOperator
arkham-odds/arkham-odds/src/cards.ts:209:72
     }
 
     if (chosenToken !== null && tokensPulled.includes(chosenToken)) {
-      return tokenEffects.isSuccess(tokensPulled, skillMinusDifficulty + 2);
+      return tokenEffects.isSuccess(tokensPulled, skillMinusDifficulty - 2);
     } else {
       return tokenEffects.isSuccess(tokensPulled, skillMinusDifficulty);

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/cards.ts:231:9
       tokensPulled
     );
 
-    if (nonRedrawTokens.some(t => BadTokens.includes(t))) {
+    if (true) {
       const onlyBad = nonRedrawTokens.filter(t => BadTokens.includes(t));
       chosenToken = tokenEffects.sortByBestOutcomeDesc(onlyBad)[0];

[Killed] BlockStatement
arkham-odds/arkham-odds/src/cards.ts:231:59
       tokensPulled
     );
 
-    if (nonRedrawTokens.some(t => BadTokens.includes(t))) {
-      const onlyBad = nonRedrawTokens.filter(t => BadTokens.includes(t));
-      chosenToken = tokenEffects.sortByBestOutcomeDesc(onlyBad)[0];
-    } else {
+    if (nonRedrawTokens.some(t => BadTokens.includes(t))) {} else {
       chosenToken = tokenEffects.sortByBestOutcomeDesc(nonRedrawTokens)[0];
     }

[Killed] ArrowFunction
arkham-odds/arkham-odds/src/cards.ts:232:46
     );
 
     if (nonRedrawTokens.some(t => BadTokens.includes(t))) {
-      const onlyBad = nonRedrawTokens.filter(t => BadTokens.includes(t));
+      const onlyBad = nonRedrawTokens.filter(() => undefined);
       chosenToken = tokenEffects.sortByBestOutcomeDesc(onlyBad)[0];
     } else {

[Killed] BlockStatement
arkham-odds/arkham-odds/src/cards.ts:234:12
     if (nonRedrawTokens.some(t => BadTokens.includes(t))) {
       const onlyBad = nonRedrawTokens.filter(t => BadTokens.includes(t));
       chosenToken = tokenEffects.sortByBestOutcomeDesc(onlyBad)[0];
-    } else {
-      chosenToken = tokenEffects.sortByBestOutcomeDesc(nonRedrawTokens)[0];
-    }
+    } else {}
 
     return tokenEffects.isSuccess(

[Killed] ArrowFunction
arkham-odds/arkham-odds/src/cards.ts:258:24
   elements: T[],
   elementsSearched: T[]
 ): boolean {
-  return elements.some(elem => elementsSearched.includes(elem));
+  return elements.some(() => undefined);
 }
 

[Killed] ArrowFunction
arkham-odds/arkham-odds/src/cards.ts:271:25
  *  not contain any of the elements provided as second argument.
  */
 function containsNoneOf<T>(elements: T[], elementsSearched: T[]): boolean {
-  return elements.every(elem => !elementsSearched.includes(elem));
+  return elements.every(() => undefined);
 }
 

[Killed] BooleanLiteral
arkham-odds/arkham-odds/src/cards.ts:271:33
  *  not contain any of the elements provided as second argument.
  */
 function containsNoneOf<T>(elements: T[], elementsSearched: T[]): boolean {
-  return elements.every(elem => !elementsSearched.includes(elem));
+  return elements.every(elem => elementsSearched.includes(elem));
 }
 

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/cards.ts:287:7
 ): OutcomeFunction {
   return (tokensPulled, tokenEffects) => {
     return (
-      containsNoneOf(tokensPulled, [
-        Token.ELDER_SIGN,
-        Token.PLUS_ONE,
-        Token.ZERO
-      ]) && tokenEffects.isSuccess(tokensPulled, skillMinusDifficulty)
+      true
     );
   };

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/cards.ts:287:7
 ): OutcomeFunction {
   return (tokensPulled, tokenEffects) => {
     return (
-      containsNoneOf(tokensPulled, [
-        Token.ELDER_SIGN,
-        Token.PLUS_ONE,
-        Token.ZERO
-      ]) && tokenEffects.isSuccess(tokensPulled, skillMinusDifficulty)
+      false
     );
   };

[Killed] LogicalOperator
arkham-odds/arkham-odds/src/cards.ts:291:10
         Token.ELDER_SIGN,
         Token.PLUS_ONE,
         Token.ZERO
-      ]) && tokenEffects.isSuccess(tokensPulled, skillMinusDifficulty)
+      ]) || tokenEffects.isSuccess(tokensPulled, skillMinusDifficulty)
     );
   };

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/cards.ts:309:7
 ): OutcomeFunction {
   return (tokensPulled, tokenEffects) => {
     return (
-      containsAtLeastOneAmong(tokensPulled, [
-        Token.ELDER_SIGN,
-        Token.PLUS_ONE,
-        Token.ZERO
-      ]) && tokenEffects.isSuccess(tokensPulled, skillMinusDifficulty)
+      true
     );
   };

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/cards.ts:309:7
 ): OutcomeFunction {
   return (tokensPulled, tokenEffects) => {
     return (
-      containsAtLeastOneAmong(tokensPulled, [
-        Token.ELDER_SIGN,
-        Token.PLUS_ONE,
-        Token.ZERO
-      ]) && tokenEffects.isSuccess(tokensPulled, skillMinusDifficulty)
+      false
     );
   };

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/cards.ts:336:7
     const sorted: Token[] = tokenEffects.sortByBestOutcomeDesc(nonRedrawTokens);
     const chosen: Token[] = sorted.slice(0, 2);
     return (
-      containsNoneOf(chosen, [Token.ELDER_SIGN, Token.PLUS_ONE, Token.ZERO]) &&
-      tokenEffects.isSuccess(chosen.concat(redrawTokens), skillMinusDifficulty)
+      false
     );
   };

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/cards.ts:336:7
     const sorted: Token[] = tokenEffects.sortByBestOutcomeDesc(nonRedrawTokens);
     const chosen: Token[] = sorted.slice(0, 2);
     return (
-      containsNoneOf(chosen, [Token.ELDER_SIGN, Token.PLUS_ONE, Token.ZERO]) &&
-      tokenEffects.isSuccess(chosen.concat(redrawTokens), skillMinusDifficulty)
+      true
     );
   };

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/cards.ts:360:7
     const sorted: Token[] = tokenEffects.sortByBestOutcomeDesc(nonRedrawTokens);
     const chosen: Token[] = sorted.slice(0, 2);
     return (
-      containsAtLeastOneAmong(chosen, [
-        Token.ELDER_SIGN,
-        Token.PLUS_ONE,
-        Token.ZERO
-      ]) &&
-      tokenEffects.isSuccess(chosen.concat(redrawTokens), skillMinusDifficulty)
+      false
     );
   };

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/cards.ts:360:7
     const sorted: Token[] = tokenEffects.sortByBestOutcomeDesc(nonRedrawTokens);
     const chosen: Token[] = sorted.slice(0, 2);
     return (
-      containsAtLeastOneAmong(chosen, [
-        Token.ELDER_SIGN,
-        Token.PLUS_ONE,
-        Token.ZERO
-      ]) &&
-      tokenEffects.isSuccess(chosen.concat(redrawTokens), skillMinusDifficulty)
+      true
     );
   };

[Killed] LogicalOperator
arkham-odds/arkham-odds/src/cards.ts:364:10
         Token.ELDER_SIGN,
         Token.PLUS_ONE,
         Token.ZERO
-      ]) &&
+      ]) ||
       tokenEffects.isSuccess(chosen.concat(redrawTokens), skillMinusDifficulty)
     );

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/cards.ts:381:9
  */
 export function jacqueline(skillMinusDifficulty: number): OutcomeFunction {
   return (tokensPulled, tokenEffects) => {
-    if (tokensPulled.includes(Token.AUTOFAIL)) {
+    if (false) {
       return tokenEffects.isSuccess(
         tokensPulled.filter(t => t !== Token.AUTOFAIL),

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/cards.ts:381:9
  */
 export function jacqueline(skillMinusDifficulty: number): OutcomeFunction {
   return (tokensPulled, tokenEffects) => {
-    if (tokensPulled.includes(Token.AUTOFAIL)) {
+    if (true) {
       return tokenEffects.isSuccess(
         tokensPulled.filter(t => t !== Token.AUTOFAIL),

[Killed] EqualityOperator
arkham-odds/arkham-odds/src/cards.ts:383:36
   return (tokensPulled, tokenEffects) => {
     if (tokensPulled.includes(Token.AUTOFAIL)) {
       return tokenEffects.isSuccess(
-        tokensPulled.filter(t => t !== Token.AUTOFAIL),
+        tokensPulled.filter(t => t === Token.AUTOFAIL),
         skillMinusDifficulty
       );

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/cards.ts:383:34
   return (tokensPulled, tokenEffects) => {
     if (tokensPulled.includes(Token.AUTOFAIL)) {
       return tokenEffects.isSuccess(
-        tokensPulled.filter(t => t !== Token.AUTOFAIL),
+        tokensPulled.filter(t => false),
         skillMinusDifficulty
       );

[Killed] UnaryOperator
arkham-odds/arkham-odds/src/cards.ts:395:25
         nonRedrawTokens
       );
       return tokenEffects.isSuccess(
-        sorted.slice(0, -2).concat(redrawTokens),
+        sorted.slice(0, +2).concat(redrawTokens),
         skillMinusDifficulty
       );
