[Killed] ArithmeticOperator
arkham-odds/arkham-odds/src/index.ts:48:66
   numberOfNonRedrawTokensInCombination: number
 ): Fraction {
   return new Fraction(
-    factorial(totalNumberOfTokens - numberOfTokensInCombination) *
+    factorial(totalNumberOfTokens - numberOfTokensInCombination) /
       factorial(numberOfTokensInCombination - 1) *
       numberOfNonRedrawTokensInCombination,

[Killed] ArithmeticOperator
arkham-odds/arkham-odds/src/index.ts:48:35
   numberOfNonRedrawTokensInCombination: number
 ): Fraction {
   return new Fraction(
-    factorial(totalNumberOfTokens - numberOfTokensInCombination) *
+    factorial(totalNumberOfTokens + numberOfTokensInCombination) *
       factorial(numberOfTokensInCombination - 1) *
       numberOfNonRedrawTokensInCombination,

[Killed] ArithmeticOperator
arkham-odds/arkham-odds/src/index.ts:49:45
 ): Fraction {
   return new Fraction(
     factorial(totalNumberOfTokens - numberOfTokensInCombination) *
-      factorial(numberOfTokensInCombination - 1) *
+      factorial(numberOfTokensInCombination + 1) *
       numberOfNonRedrawTokensInCombination,
     factorial(totalNumberOfTokens)

[Killed] ArithmeticOperator
arkham-odds/arkham-odds/src/index.ts:49:50
 ): Fraction {
   return new Fraction(
     factorial(totalNumberOfTokens - numberOfTokensInCombination) *
-      factorial(numberOfTokensInCombination - 1) *
+      factorial(numberOfTokensInCombination - 1) /
       numberOfNonRedrawTokensInCombination,
     factorial(totalNumberOfTokens)

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/index.ts:78:7
   outcomes?: TokenEffects
 ): PullWithOdds[] {
   let allPossibleCombinations: Token[][] = [];
-  if (outcomes) {
+  if (false) {
     const tokensWithRedraw = bag
       .getTokens()

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/index.ts:78:7
   outcomes?: TokenEffects
 ): PullWithOdds[] {
   let allPossibleCombinations: Token[][] = [];
-  if (outcomes) {
+  if (true) {
     const tokensWithRedraw = bag
       .getTokens()

[Killed] ArrowFunction
arkham-odds/arkham-odds/src/index.ts:81:15
   if (outcomes) {
     const tokensWithRedraw = bag
       .getTokens()
-      .filter(t => outcomes.getEffect(t).isRedraw());
+      .filter(() => undefined);
     const tokensWithoutRedraw = bag
       .getTokens()

[Killed] ArrowFunction
arkham-odds/arkham-odds/src/index.ts:84:15
       .filter(t => outcomes.getEffect(t).isRedraw());
     const tokensWithoutRedraw = bag
       .getTokens()
-      .filter(t => !outcomes.getEffect(t).isRedraw());
+      .filter(() => undefined);
 
     const combinationsOfRedrawTokens = allCombinations(tokensWithRedraw);

[Killed] BooleanLiteral
arkham-odds/arkham-odds/src/index.ts:84:20
       .filter(t => outcomes.getEffect(t).isRedraw());
     const tokensWithoutRedraw = bag
       .getTokens()
-      .filter(t => !outcomes.getEffect(t).isRedraw());
+      .filter(t => outcomes.getEffect(t).isRedraw());
 
     const combinationsOfRedrawTokens = allCombinations(tokensWithRedraw);

[Killed] ArrowFunction
arkham-odds/arkham-odds/src/index.ts:95:11
     allPossibleCombinations = cartesianProduct(
       combinationsOfRedrawTokens,
       combinationsOfNonRedrawTokens
-    ).map(c => flatten(c));
+    ).map(() => undefined);
   } else {
     allPossibleCombinations = combinations(numTokensPulled, bag.getTokens());

[Killed] BlockStatement
arkham-odds/arkham-odds/src/index.ts:96:10
       combinationsOfRedrawTokens,
       combinationsOfNonRedrawTokens
     ).map(c => flatten(c));
-  } else {
-    allPossibleCombinations = combinations(numTokensPulled, bag.getTokens());
-  }
+  } else {}
 
   const allCombinationsWithOdds: PullWithOdds[] = allPossibleCombinations.map(

[Killed] ArrowFunction
arkham-odds/arkham-odds/src/index.ts:101:5
   }
 
   const allCombinationsWithOdds: PullWithOdds[] = allPossibleCombinations.map(
-    tokens => ({
-      odds: oddsOfCombination(
-        bag.getTokens().length,
-        tokens.length,
-        outcomes
-          ? tokens.filter(token => !outcomes.getEffect(token).isRedraw()).length
-          : tokens.length
-      ),
-      tokens: tokens.sort()
-    })
+    () => undefined
   );
 

[Killed] ArrowFunction
arkham-odds/arkham-odds/src/index.ts:106:27
         bag.getTokens().length,
         tokens.length,
         outcomes
-          ? tokens.filter(token => !outcomes.getEffect(token).isRedraw()).length
+          ? tokens.filter(() => undefined).length
           : tokens.length
       ),

[Killed] BooleanLiteral
arkham-odds/arkham-odds/src/index.ts:106:36
         bag.getTokens().length,
         tokens.length,
         outcomes
-          ? tokens.filter(token => !outcomes.getEffect(token).isRedraw()).length
+          ? tokens.filter(token => outcomes.getEffect(token).isRedraw()).length
           : tokens.length
       ),

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/index.ts:115:11
 
   return allCombinationsWithOdds.reduce(
     (reducedCombinations: PullWithOdds[], currentCombination: PullWithOdds) => {
-      if (reducedCombinations.length === 0) {
+      if (true) {
         return [currentCombination];
       } else {

[Killed] EqualityOperator
arkham-odds/arkham-odds/src/index.ts:115:38
 
   return allCombinationsWithOdds.reduce(
     (reducedCombinations: PullWithOdds[], currentCombination: PullWithOdds) => {
-      if (reducedCombinations.length === 0) {
+      if (reducedCombinations.length !== 0) {
         return [currentCombination];
       } else {

[Killed] ArrayDeclaration
arkham-odds/arkham-odds/src/index.ts:116:16
   return allCombinationsWithOdds.reduce(
     (reducedCombinations: PullWithOdds[], currentCombination: PullWithOdds) => {
       if (reducedCombinations.length === 0) {
-        return [currentCombination];
+        return [];
       } else {
         // Find a combination with the same set of tokens

[Killed] ArrowFunction
arkham-odds/arkham-odds/src/index.ts:120:11
       } else {
         // Find a combination with the same set of tokens
         const matchingCombinationIndex = reducedCombinations.findIndex(
-          ({ tokens }) => arrayEquals(tokens, currentCombination.tokens)
+          () => undefined
         );
         if (matchingCombinationIndex > -1) {

[Killed] EqualityOperator
arkham-odds/arkham-odds/src/index.ts:122:38
         const matchingCombinationIndex = reducedCombinations.findIndex(
           ({ tokens }) => arrayEquals(tokens, currentCombination.tokens)
         );
-        if (matchingCombinationIndex > -1) {
+        if (matchingCombinationIndex >= -1) {
           // Update the existing combination by adding the odds
           const updatedCombination = {

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/index.ts:122:13
         const matchingCombinationIndex = reducedCombinations.findIndex(
           ({ tokens }) => arrayEquals(tokens, currentCombination.tokens)
         );
-        if (matchingCombinationIndex > -1) {
+        if (false) {
           // Update the existing combination by adding the odds
           const updatedCombination = {

[Killed] ArrowFunction
arkham-odds/arkham-odds/src/index.ts:169:5
   outcomes?: TokenEffects
 ): { tokens: Token[]; odds: number }[] {
   return getPossiblePullsWithOdds(numTokensPulled, bag, outcomes).map(
-    pullWithOdds => ({
-      odds: pullWithOdds.odds.valueOf(),
-      tokens: pullWithOdds.tokens
-    })
+    () => undefined
   );
 }

[Killed] BlockStatement
arkham-odds/arkham-odds/src/index.ts:231:67
     outcomes
   );
 
-  const filterCondition = (possiblePullWithOdds: PullWithOdds) => {
-    return outcomeFunction(possiblePullWithOdds.tokens, outcomes, bag);
-  };
+  const filterCondition = (possiblePullWithOdds: PullWithOdds) => {};
 
   return possiblePullsWithOdds

[Killed] ArrowFunction
arkham-odds/arkham-odds/src/index.ts:238:7
   return possiblePullsWithOdds
     .filter(filterCondition)
     .reduce(
-      (totalOdds, successfulPullWithOdds) =>
-        totalOdds.add(successfulPullWithOdds.odds),
+      () => undefined,
       new Fraction(0, 1)
     )

[Killed] ArrayDeclaration
arkham-odds/arkham-odds/src/index.ts:279:8
   outcomeFunction: OutcomeFunction
 ): number => {
   const comb: Token[][] = cartesianProduct(
-    ...Array(numTokensPulled).fill(bag.getTokens())
+    ...Array().fill(bag.getTokens())
   );
   const filterCondition = (tokensPulled: Token[]) => {

[Killed] BlockStatement
arkham-odds/arkham-odds/src/index.ts:281:54
   const comb: Token[][] = cartesianProduct(
     ...Array(numTokensPulled).fill(bag.getTokens())
   );
-  const filterCondition = (tokensPulled: Token[]) => {
-    return outcomeFunction(tokensPulled, outcomes, bag);
-  };
+  const filterCondition = (tokensPulled: Token[]) => {};
   return comb.filter(filterCondition).length / comb.length;
 };

[Killed] ArithmeticOperator
arkham-odds/arkham-odds/src/index.ts:284:46
   const filterCondition = (tokensPulled: Token[]) => {
     return outcomeFunction(tokensPulled, outcomes, bag);
   };
-  return comb.filter(filterCondition).length / comb.length;
+  return comb.filter(filterCondition).length * comb.length;
 };
 
