[Killed] BooleanLiteral
arkham-odds/src/tokens/Modifier.ts:14:41
   /**
    * Create a new modifier given the modifier value.
    */
-  constructor(value: number, isRedraw = false) {
+  constructor(value: number, isRedraw = true) {
     this._value = value;
     this._isRedraw = isRedraw;

[Killed] LogicalOperator
arkham-odds/src/tokens/Modifier.ts:40:60
   public sameAs(other: TokenEffect): boolean {
     if (other instanceof Modifier) {
       return (
-        this.getValue() === (other as Modifier).getValue() &&
+        this.getValue() === (other as Modifier).getValue() ||
         this.isRedraw() === (other as Modifier).isRedraw()
       );
