[Killed] BooleanLiteral
arkham-odds/arkham-odds/src/utils.ts:13:15
  *   A new array with the element removed if original array contained it.
  */
 export function removeFirst<T>(elems: T[], elem: T): T[] {
-  let found = false;
+  let found = true;
   return elems.filter(e => {
     if (found) {

[Killed] BlockStatement
arkham-odds/arkham-odds/src/utils.ts:14:28
  */
 export function removeFirst<T>(elems: T[], elem: T): T[] {
   let found = false;
-  return elems.filter(e => {
-    if (found) {
-      return true;
-    } else {
-      if (e === elem) {
-        found = true;
-        return false;
-      } else {
-        return true;
-      }
-    }
-  });
+  return elems.filter(e => {});
 }
 

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/utils.ts:15:9
 export function removeFirst<T>(elems: T[], elem: T): T[] {
   let found = false;
   return elems.filter(e => {
-    if (found) {
+    if (true) {
       return true;
     } else {

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/utils.ts:15:9
 export function removeFirst<T>(elems: T[], elem: T): T[] {
   let found = false;
   return elems.filter(e => {
-    if (found) {
+    if (false) {
       return true;
     } else {

[Killed] BooleanLiteral
arkham-odds/arkham-odds/src/utils.ts:16:14
   let found = false;
   return elems.filter(e => {
     if (found) {
-      return true;
+      return false;
     } else {
       if (e === elem) {

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/utils.ts:18:11
     if (found) {
       return true;
     } else {
-      if (e === elem) {
+      if (true) {
         found = true;
         return false;

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/utils.ts:18:11
     if (found) {
       return true;
     } else {
-      if (e === elem) {
+      if (false) {
         found = true;
         return false;

[Killed] BooleanLiteral
arkham-odds/arkham-odds/src/utils.ts:19:17
       return true;
     } else {
       if (e === elem) {
-        found = true;
+        found = false;
         return false;
       } else {

[Killed] BooleanLiteral
arkham-odds/arkham-odds/src/utils.ts:20:16
     } else {
       if (e === elem) {
         found = true;
-        return false;
+        return true;
       } else {
         return true;

[Killed] BooleanLiteral
arkham-odds/arkham-odds/src/utils.ts:22:16
         found = true;
         return false;
       } else {
-        return true;
+        return false;
       }
     }

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/utils.ts:41:7
  *   A new array with the element replaced.
  */
 export function replace<T>(elems: T[], idx: number, elem: T): T[] {
-  if (idx >= 0 && idx < elems.length) {
+  if (false) {
     return [...elems.slice(0, idx), elem, ...elems.slice(idx + 1)];
   } else {

[Killed] EqualityOperator
arkham-odds/arkham-odds/src/utils.ts:41:23
  *   A new array with the element replaced.
  */
 export function replace<T>(elems: T[], idx: number, elem: T): T[] {
-  if (idx >= 0 && idx < elems.length) {
+  if (idx >= 0 && idx >= elems.length) {
     return [...elems.slice(0, idx), elem, ...elems.slice(idx + 1)];
   } else {

[Killed] ArrayDeclaration
arkham-odds/arkham-odds/src/utils.ts:42:12
  */
 export function replace<T>(elems: T[], idx: number, elem: T): T[] {
   if (idx >= 0 && idx < elems.length) {
-    return [...elems.slice(0, idx), elem, ...elems.slice(idx + 1)];
+    return [];
   } else {
     return [...elems];

[Killed] EqualityOperator
arkham-odds/arkham-odds/src/utils.ts:49:20
 }
 
 function tails<T>(elems: T[]): T[][] {
-  if (elems.length === 0) {
+  if (elems.length !== 0) {
     return [[]];
   }

[Killed] BlockStatement
arkham-odds/arkham-odds/src/utils.ts:49:27
 }
 
 function tails<T>(elems: T[]): T[][] {
-  if (elems.length === 0) {
-    return [[]];
-  }
+  if (elems.length === 0) {}
 
   const a = tails(elems.slice(1));

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/utils.ts:73:7
  *   True if `a` and `b` contains the same values in the same order.
  */
 export function arrayEquals<T>(a: T[], b: T[]): boolean {
-  if (!(Array.isArray(a) && Array.isArray(b))) {
+  if (true) {
     return false;
   }

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/utils.ts:77:7
     return false;
   }
 
-  if (a.length !== b.length) {
+  if (false) {
     return false;
   }

[Killed] EqualityOperator
arkham-odds/arkham-odds/src/utils.ts:81:21
     return false;
   }
 
-  for (let i = 0; i < a.length; i++) {
+  for (let i = 0; i >= a.length; i++) {
     if (a[i] !== b[i]) {
       return false;

[Killed] BlockStatement
arkham-odds/arkham-odds/src/utils.ts:101:15
  *   All possible combinations of `k` elements among `elems`.
  */
 export function combinations<T>(k: number, elems: T[]): T[][] {
-  if (k <= 0) {
-    return [[]];
-  }
+  if (k <= 0) {}
 
   // Get all tails

[Killed] EqualityOperator
arkham-odds/arkham-odds/src/utils.ts:101:9
  *   All possible combinations of `k` elements among `elems`.
  */
 export function combinations<T>(k: number, elems: T[]): T[][] {
-  if (k <= 0) {
+  if (k < 0) {
     return [[]];
   }

[Killed] ArrayDeclaration
arkham-odds/arkham-odds/src/utils.ts:102:12
  */
 export function combinations<T>(k: number, elems: T[]): T[][] {
   if (k <= 0) {
-    return [[]];
+    return [];
   }
 

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/utils.ts:108:9
   // Get all tails
   return tails(elems).reduce((acc, tailOfElems) => {
     // For each tail ...
-    if (tailOfElems.length === 0) {
+    if (false) {
       return acc;
     }

[Killed] BlockStatement
arkham-odds/arkham-odds/src/utils.ts:108:35
   // Get all tails
   return tails(elems).reduce((acc, tailOfElems) => {
     // For each tail ...
-    if (tailOfElems.length === 0) {
-      return acc;
-    }
+    if (tailOfElems.length === 0) {}
 
     // Recursion : get all combinations of (k-1) elements with end elements

[Killed] ArithmeticOperator
arkham-odds/arkham-odds/src/utils.ts:113:45
     }
 
     // Recursion : get all combinations of (k-1) elements with end elements
-    const tailCombinations = combinations(k - 1, tailOfElems.slice(1));
+    const tailCombinations = combinations(k + 1, tailOfElems.slice(1));
 
     // Prepend first element to all combinations

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/utils.ts:128:19
 
 export function allCombinations<T>(elems: T[]): T[][] {
   let allComb: T[][] = [];
-  for (let i = 0; i <= elems.length; i++) {
+  for (let i = 0; false; i++) {
     allComb = allComb.concat(combinations(i, elems));
   }

[Killed] EqualityOperator
arkham-odds/arkham-odds/src/utils.ts:128:21
 
 export function allCombinations<T>(elems: T[]): T[][] {
   let allComb: T[][] = [];
-  for (let i = 0; i <= elems.length; i++) {
+  for (let i = 0; i < elems.length; i++) {
     allComb = allComb.concat(combinations(i, elems));
   }

[Killed] ArrayDeclaration
arkham-odds/arkham-odds/src/utils.ts:145:5
         })
       );
     },
-    [[]] as T[][]
+    [] as T[][]
   );
 }

[Killed] BlockStatement
arkham-odds/arkham-odds/src/utils.ts:162:32
  */
 export function factorial(n: number): number {
   let returnValue = 1;
-  for (let i = 2; i <= n; i++) {
-    returnValue = returnValue * i;
-  }
+  for (let i = 2; i <= n; i++) {}
   return returnValue;
 }

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/utils.ts:162:19
  */
 export function factorial(n: number): number {
   let returnValue = 1;
-  for (let i = 2; i <= n; i++) {
+  for (let i = 2; false; i++) {
     returnValue = returnValue * i;
   }

[Killed] ArithmeticOperator
arkham-odds/arkham-odds/src/utils.ts:163:31
 export function factorial(n: number): number {
   let returnValue = 1;
   for (let i = 2; i <= n; i++) {
-    returnValue = returnValue * i;
+    returnValue = returnValue / i;
   }
   return returnValue;
