[Killed] EqualityOperator
arkham-odds/arkham-odds/src/Fraction.ts:2:9
 function gcd(a: number, b: number): number {
-  if (b > a) {
+  if (b >= a) {
     return gcd(b, a);
   }

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/Fraction.ts:2:7
 function gcd(a: number, b: number): number {
-  if (b > a) {
+  if (true) {
     return gcd(b, a);
   }

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/Fraction.ts:6:7
     return gcd(b, a);
   }
 
-  if (b === 0) {
+  if (false) {
     return a;
   } else {

[Killed] ArithmeticOperator
arkham-odds/arkham-odds/src/Fraction.ts:9:21
   if (b === 0) {
     return a;
   } else {
-    return gcd(b, a % b);
+    return gcd(b, a * b);
   }
 }

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/Fraction.ts:73:7
     this._reduce();
     other._reduce();
     return (
-      this._numerator === other._numerator &&
+      false &&
       this._denominator === other._denominator
     );
