[Killed] ConditionalExpression
arkham-odds/src/tokens/Modifier.ts:38:9
   }
 
   public sameAs(other: TokenEffect): boolean {
-    if (other instanceof Modifier) {
+    if (false) {
       return (
         this.getValue() === (other as Modifier).getValue() &&

[Killed] ConditionalExpression
arkham-odds/src/tokens/Modifier.ts:41:9
     if (other instanceof Modifier) {
       return (
         this.getValue() === (other as Modifier).getValue() &&
-        this.isRedraw() === (other as Modifier).isRedraw()
+        true
       );
     } else {
