[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/utils.ts:49:7
 }
 
 function tails<T>(elems: T[]): T[][] {
-  if (elems.length === 0) {
+  if (false) {
     return [[]];
   }

[Killed] BooleanLiteral
arkham-odds/arkham-odds/src/utils.ts:73:7
  *   True if `a` and `b` contains the same values in the same order.
  */
 export function arrayEquals<T>(a: T[], b: T[]): boolean {
-  if (!(Array.isArray(a) && Array.isArray(b))) {
+  if ((Array.isArray(a) && Array.isArray(b))) {
     return false;
   }

[Killed] BlockStatement
arkham-odds/arkham-odds/src/utils.ts:77:30
     return false;
   }
 
-  if (a.length !== b.length) {
-    return false;
-  }
+  if (a.length !== b.length) {}
 
   for (let i = 0; i < a.length; i++) {

[Killed] ConditionalExpression
arkham-odds/arkham-odds/src/utils.ts:82:9
   }
 
   for (let i = 0; i < a.length; i++) {
-    if (a[i] !== b[i]) {
+    if (false) {
       return false;
     }

[Killed] EqualityOperator
arkham-odds/arkham-odds/src/utils.ts:101:9
  *   All possible combinations of `k` elements among `elems`.
  */
 export function combinations<T>(k: number, elems: T[]): T[][] {
-  if (k <= 0) {
+  if (k > 0) {
     return [[]];
   }

[Timeout] EqualityOperator
arkham-odds/arkham-odds/src/utils.ts:162:21
  */
 export function factorial(n: number): number {
   let returnValue = 1;
-  for (let i = 2; i <= n; i++) {
+  for (let i = 2; i > n; i++) {
     returnValue = returnValue * i;
   }
